<script setup>

</script>

<template>
    <div class="faq-container">
        <h1>Кулінарний FAQ</h1>
        <div class="faq-item">
            <div class="question">Як правильно варити пасту?</div>
            <div class="answer">Для приготування ідеальної пасти використовуйте багато води, додайте сіль і варіть на
                великому вогні, помішуючи. Перевіряйте готовність через 8-10 хвилин або згідно з інструкцією на
                упаковці.</div>
        </div>
        <div class="faq-item">
            <div class="question">Як зберігати зелень свіжою?</div>
            <div class="answer">Для зберігання свіжої зелені помийте її, добре висушіть і загорніть у паперовий рушник.
                Потім покладіть у герметичний контейнер або пакет і зберігайте в холодильнику.</div>
        </div>
        <div class="faq-item">
            <div class="question">Як правильно приготувати рис?</div>
            <div class="answer">Промийте рис кілька разів, поки вода не стане прозорою. Додайте води у співвідношенні
                1:2, доведіть до кипіння, зменшіть вогонь і накрийте кришкою. Варіть 15-20 хвилин, не знімаючи кришку.
            </div>
        </div>
        <div class="faq-item">
            <div class="question">Як запобігти прилипанню млинців до сковорідки?</div>
            <div class="answer">Переконайтеся, що сковорідка добре розігріта перед тим, як додавати тісто. Змастіть її
                тонким шаром олії або вершкового масла. Використовуйте рівномірно перемішане тісто.</div>
        </div>
        <div class="faq-item">
            <div class="question">Чим можна замінити яйце в рецептах випічки?</div>
            <div class="answer">Якщо потрібно замінити яйце, можна використовувати мелене насіння льону, бананове пюре
                або яблучне пюре. Одне яйце можна замінити 1 столовою ложкою меленого льону, змішаного з 3 столовими
                ложками води.</div>
        </div>
    </div>
</template>

<style>
    @import url('../styles/faq_style');
</style>